//p5-17.cpp - многомерные массивы - доступ по указателям
#include <iostream>

using namespace std;

int main()
{
	int b[3][2][4] = {  
		0,   1,   2,   3,
		10,  11,  12,  13,
		100, 101, 102, 103,
		110, 111, 112, 113,
		200, 201, 202, 203,
		210, 211, 212, 213
		}, x, y, z;
  
	int ar[3][3][3] = { 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 
		19, 20, 21, 22, 23, 24, 25, 26, 27}; 
	
	char *ptr [] = { "Ivanov", "Petrov", "sidorov" };
  
  // Адрес массива b[][][]
  cout << "\nАдрес массива b[][][] " << " b = " << b;
  
  // Адрес массива b[0][][]
  cout << "\nАдрес массива b[0][][]  *b = " << *b;
  
  // Адрес массива b[0][0][]
  cout << "\nАдрес массива b[0][0][]  **b = " << **b;
  
  // Элемент массива b[0][0][0]
  cout << "\nЭлемент массива b[0][0][0]  ***b = " << ***b;
  
  // Адрес массива b[1][][]
  cout << "\nАдрес массива b[1][][]  *(b + 1) = " << *(b + 1);
  
  // Адрес массива b[2][][]
  cout << "\nАдрес массива b[2][][]  *(b + 2) = " << *(b + 2);
  
  // Адрес массива b[0][1][]
  cout << "\nАдрес массива b[0][1][]  *(*b + 1) = " << *(*b + 1);
  cout << "\nАдрес массива b[0][1][]  *(*(*(b + 1) + 1) + 1) = " << *(*(*(b + 1) + 1) + 1);
  cout << "\nАдрес массива b[0][1][]  *(b[1][1] + 1) = " << *(b[1][1] + 1);
  
  // Элемент b[2][0][0]
  cout << "\nЭлемент массива b[2][0][0]  *(b[1] + 1)[1] = " << *(b[1] + 1)[1];
  
  cout << "\nВведите x - ";
  cin >> x;
  cout << "\nВведите y - ";
  cin >> y;
  cout << "\nВведите z - ";
    cin >> z;
  cout << "\n Элемент ar[" << 1 << "][" << 0 << "][" << 2 << "] равен " << ar[1][0][2] << endl;
  
  cout << "\n Элемент ar[" << 1 << "][" << 0 << "][" << 2 << "] равен " << *(*(*(ar + 1) + 0) + 2) << endl;
  
  return 0;
}





